Documents/ЗаявлениеОВыдачеСудебногоПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявлениеОВыдачеСудебногоПриказа</Name>
			<BasedOn>
				<xr:Item>Document.Претензия</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСудебнойИнстанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявлениеОВыдачеСудебногоПриказа/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// Работа с макетами офисных документов.

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "Заявление(MSWord)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, 
											УправлениеПечатью.ПолучитьМакет("Документ.ЗаявлениеОВыдачеСудебногоПриказа.ПФ_DOC_ЗаявлениеОВыдачеСудебногоПриказа"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		ИначеЕсли ИмяМакета = "Заявление(ODT)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.ПолучитьМакет("Документ.ЗаявлениеОВыдачеСудебногоПриказа.ПФ_DOC_ЗаявлениеОВыдачеСудебногоПриказа"));
			ТипыМакетов.Вставить(ИмяМакета, "ODT");
		КонецЕсли;
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект)
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	Если Объект.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из Объект.Здание.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Адрес = СтрокаАдреса.ЗначенияПолей;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
	
	Если Объект.Организация.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из Объект.Организация.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
				АдресОрганизации = СтрокаАдреса.ЗначенияПолей;
			ИначеЕсли СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
				ТелефонОрганизации = СтрокаАдреса.Представление;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		АдресОрганизации = "";
		ТелефонОрганизации = "";
	КонецЕсли;
				
	СтруктураАдреса = НайтиРеквизитыАдреса(Адрес);
	
	Попытка
		АдресКратко = "м. " + СтруктураАдреса.Город + ", вул. " + СтруктураАдреса.Улица + ", буд. №" + СтруктураАдреса.Дом;
		Улица = СтруктураАдреса.Улица;
        НомерДома = СтруктураАдреса.Дом;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес здания. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу будівлі. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	
	СтруктураАдреса = НайтиРеквизитыАдреса(АдресОрганизации);
	
	Попытка
		АдресОрганизацииКратко = "м. " + СтруктураАдреса.Город + ", вул. " + СтруктураАдреса.Улица + ", буд. №" + СтруктураАдреса.Дом;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес организации. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу організації. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	
	ДанныеОбъекта = Новый Структура;
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Номер, Истина, Истина);
	
	ДанныеОбъекта.Вставить("НомерДокумента",	НомерДокумента);
	ДанныеОбъекта.Вставить("ДатаДокумента",		Формат(Объект.Дата,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ЕДРПОУ",			Объект.Организация.КодПоЕДРПОУ);
	ДанныеОбъекта.Вставить("ОрганизацияАдрес",	АдресОрганизацииКратко);
	ДанныеОбъекта.Вставить("Должник",			Объект.Должник);
	ДанныеОбъекта.Вставить("КонечныйДолг",		Объект.СуммаДолга);
	ДанныеОбъекта.Вставить("Организация",		Объект.Организация);
	ДанныеОбъекта.Вставить("Адрес",				АдресКратко);
	ДанныеОбъекта.Вставить("Улица",				Улица);
	ДанныеОбъекта.Вставить("НомерДома",			НомерДома);
	ДанныеОбъекта.Вставить("Директор",			Объект.Организация.ТекущийРуководитель);
	ДанныеОбъекта.Вставить("НачалоПериода",		Формат(Объект.НачалоПериода,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("КонецПериода",		Формат(Объект.КонецПериода,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("Квартира",			Объект.ЛицевойСчет.ОбъектЛицевогоСчета);
	ДанныеОбъекта.Вставить("НазваниеСуда",		Объект.СудебнаяИнстанция);
	ДанныеОбъекта.Вставить("АдресСуда",			Объект.АдресСудебнойИнстанции);
    ДанныеОбъекта.Вставить("НачальныйДолг",		Объект.НачальнаяСуммаДолга);
	ДанныеОбъекта.Вставить("СудебныйСбор",		Объект.СудебныйСбор);
	ДанныеОбъекта.Вставить("Оплачено",			Объект.Оплачено);
	ДанныеОбъекта.Вставить("Счет",				ПечатьКвитанцииНаОплату2.ПолучитьПредставлениеБанковскогоСчета(Объект.БанковскийСчет));
	ДанныеОбъекта.Вставить("Банк",				Объект.БанковскийСчет.Банк);
	ДанныеОбъекта.Вставить("МФО",				Объект.БанковскийСчет.Код);
	ДанныеОбъекта.Вставить("Число",				Формат(Объект.Дата,"ДФ=dd"));
	ДанныеОбъекта.Вставить("Месяц",				Формат(Объект.Дата,"ДФ=MM.yyyy"));

	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Тело",					"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",				"Общая");

	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция НайтиРеквизитыАдреса(Адрес)
	
	СтруктураАдреса = Новый Структура;
	КлючПоследнегоЭлемента = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(Адрес) Цикл
		Стр = СтрПолучитьСтроку(Адрес, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если КлючПоследнегоЭлемента <> Неопределено Тогда
				СтруктураАдреса.Вставить(
				КлючПоследнегоЭлемента,
				СтруктураАдреса[КлючПоследнегоЭлемента] + Символы.ПС + Сред(Стр, 2)
				);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				КлючПоследнегоЭлемента = Лев(Стр, Поз-1);
				СтруктураАдреса.Вставить(КлючПоследнегоЭлемента, СокрЛП(Сред(Стр, Поз+1)));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураАдреса;
	
КонецФункции // ()
